MikroElektronika/core_packages/PIC/XC8/def/PIC16F18323/mcu.h
// Register: MDCIN2PPS
#define MDCIN2PPS MDCIN2PPS
extern volatile unsigned char           MDCIN2PPS           __at(0xE1B);
#ifndef _LIB_BUILD
asm("MDCIN2PPS equ 0E1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCIN2PPS              :5;
    };
    struct {
        unsigned MDCIN2PPS0             :1;
        unsigned MDCIN2PPS1             :1;
        unsigned MDCIN2PPS2             :1;
        unsigned MDCIN2PPS3             :1;
        unsigned MDCIN2PPS4             :1;
    };
} MDCIN2PPSbits_t;
extern volatile MDCIN2PPSbits_t MDCIN2PPSbits __at(0xE1B);
// bitfield macros
#define _MDCIN2PPS_MDCIN2PPS_POSN                           0x0
#define _MDCIN2PPS_MDCIN2PPS_POSITION                       0x0
#define _MDCIN2PPS_MDCIN2PPS_SIZE                           0x5
#define _MDCIN2PPS_MDCIN2PPS_LENGTH                         0x5
#define _MDCIN2PPS_MDCIN2PPS_MASK                           0x1F
#define _MDCIN2PPS_MDCIN2PPS0_POSN                          0x0
#define _MDCIN2PPS_MDCIN2PPS0_POSITION                      0x0
#define _MDCIN2PPS_MDCIN2PPS0_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS0_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS0_MASK                          0x1
#define _MDCIN2PPS_MDCIN2PPS1_POSN                          0x1
#define _MDCIN2PPS_MDCIN2PPS1_POSITION                      0x1
#define _MDCIN2PPS_MDCIN2PPS1_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS1_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS1_MASK                          0x2
#define _MDCIN2PPS_MDCIN2PPS2_POSN                          0x2
#define _MDCIN2PPS_MDCIN2PPS2_POSITION                      0x2
#define _MDCIN2PPS_MDCIN2PPS2_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS2_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS2_MASK                          0x4
#define _MDCIN2PPS_MDCIN2PPS3_POSN                          0x3
#define _MDCIN2PPS_MDCIN2PPS3_POSITION                      0x3
#define _MDCIN2PPS_MDCIN2PPS3_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS3_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS3_MASK                          0x8
#define _MDCIN2PPS_MDCIN2PPS4_POSN                          0x4
#define _MDCIN2PPS_MDCIN2PPS4_POSITION                      0x4
#define _MDCIN2PPS_MDCIN2PPS4_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS4_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS4_MASK                          0x10

// Register: MDMINPPS
#define MDMINPPS MDMINPPS
extern volatile unsigned char           MDMINPPS            __at(0xE1C);
#ifndef _LIB_BUILD
asm("MDMINPPS equ 0E1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDMINPPS               :5;
    };
    struct {
        unsigned MDMINPPS0              :1;
        unsigned MDMINPPS1              :1;
        unsigned MDMINPPS2              :1;
        unsigned MDMINPPS3              :1;
        unsigned MDMINPPS4              :1;
    };
} MDMINPPSbits_t;
extern volatile MDMINPPSbits_t MDMINPPSbits __at(0xE1C);
// bitfield macros
#define _MDMINPPS_MDMINPPS_POSN                             0x0
#define _MDMINPPS_MDMINPPS_POSITION                         0x0
#define _MDMINPPS_MDMINPPS_SIZE                             0x5
#define _MDMINPPS_MDMINPPS_LENGTH                           0x5
#define _MDMINPPS_MDMINPPS_MASK                             0x1F
#define _MDMINPPS_MDMINPPS0_POSN                            0x0
#define _MDMINPPS_MDMINPPS0_POSITION                        0x0
#define _MDMINPPS_MDMINPPS0_SIZE                            0x1
#define _MDMINPPS_MDMINPPS0_LENGTH                          0x1
#define _MDMINPPS_MDMINPPS0_MASK                            0x1
#define _MDMINPPS_MDMINPPS1_POSN                            0x1
#define _MDMINPPS_MDMINPPS1_POSITION                        0x1
#define _MDMINPPS_MDMINPPS1_SIZE                            0x1
#define _MDMINPPS_MDMINPPS1_LENGTH                          0x1
#define _MDMINPPS_MDMINPPS1_MASK                            0x2
#define _MDMINPPS_MDMINPPS2_POSN                            0x2
#define _MDMINPPS_MDMINPPS2_POSITION                        0x2
#define _MDMINPPS_MDMINPPS2_SIZE                            0x1
#define _MDMINPPS_MDMINPPS2_LENGTH                          0x1
#define _MDMINPPS_MDMINPPS2_MASK                            0x4
#define _MDMINPPS_MDMINPPS3_POSN                            0x3
#define _MDMINPPS_MDMINPPS3_POSITION                        0x3
#define _MDMINPPS_MDMINPPS3_SIZE                            0x1
#define _MDMINPPS_MDMINPPS3_LENGTH                          0x1
#define _MDMINPPS_MDMINPPS3_MASK                            0x8
#define _MDMINPPS_MDMINPPS4_POSN                            0x4
#define _MDMINPPS_MDMINPPS4_POSITION                        0x4
#define _MDMINPPS_MDMINPPS4_SIZE                            0x1
#define _MDMINPPS_MDMINPPS4_LENGTH                          0x1
#define _MDMINPPS_MDMINPPS4_MASK                            0x10

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
extern volatile unsigned char           SSP1CLKPPS          __at(0xE20);
#ifndef _LIB_BUILD
asm("SSP1CLKPPS equ 0E20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1CLKPPS             :5;
    };
    struct {
        unsigned SSP1CLKPPS0            :1;
        unsigned SSP1CLKPPS1            :1;
        unsigned SSP1CLKPPS2            :1;
        unsigned SSP1CLKPPS3            :1;
        unsigned SSP1CLKPPS4            :1;
    };
} SSP1CLKPPSbits_t;
extern volatile SSP1CLKPPSbits_t SSP1CLKPPSbits __at(0xE20);
// bitfield macros
#define _SSP1CLKPPS_SSP1CLKPPS_POSN                         0x0
#define _SSP1CLKPPS_SSP1CLKPPS_POSITION                     0x0
#define _SSP1CLKPPS_SSP1CLKPPS_SIZE                         0x5
#define _SSP1CLKPPS_SSP1CLKPPS_LENGTH                       0x5
#define _SSP1CLKPPS_SSP1CLKPPS_MASK                         0x1F
#define _SSP1CLKPPS_SSP1CLKPPS0_POSN                        0x0
#define _SSP1CLKPPS_SSP1CLKPPS0_POSITION                    0x0
#define _SSP1CLKPPS_SSP1CLKPPS0_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS0_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS0_MASK                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_POSN                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_POSITION                    0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_MASK                        0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_POSN                        0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_POSITION                    0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS2_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS2_MASK                        0x4
#define _SSP1CLKPPS_SSP1CLKPPS3_POSN                        0x3
#define _SSP1CLKPPS_SSP1CLKPPS3_POSITION                    0x3
#define _SSP1CLKPPS_SSP1CLKPPS3_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS3_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS3_MASK                        0x8
#define _SSP1CLKPPS_SSP1CLKPPS4_POSN                        0x4
#define _SSP1CLKPPS_SSP1CLKPPS4_POSITION                    0x4
#define _SSP1CLKPPS_SSP1CLKPPS4_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS4_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS4_MASK                        0x10

